Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.OffsetEnum Enumeration
 The offset distance type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum OffsetEnum
Public Enumeration OffsetEnum
Members
Member name | Value | Description
EXACT | 0 |  The offset distance is exact.
MINIMUM | 1 |  The offset distance is the minimum required.
See Also
Reference
Tekla.Structures.Model Namespace